["I ordered these because I am so hard on my Apple watch face.  I have used sticky protectors in the past but felt that I needed something more durable.  I ordered these and was pleasantly surprised when they arrived.  There are many different colors/patterns in the package and they snap onto my watch with ease.  They're stylish and do a GREAT job protecting my watch face.My only problem with them is that they don't always respond right away to my touch - I have to tap on them several times to get them to wake the watch face up and allow me to do anything.  Other than that, they're fantastic!", "I love to change my bands on my Apple Watch to coordinate with my outfits. Changing the watch color and the protection is great and complimentary. Easy to switch out", "These are not the fanciest watch guards, however you get a great variety of colors if you want to be able to change up the look of your watch easily.They go on easily. You need to watch for water to get under the cover because that is the only time I have had a problem with the touchscreen. Quick and easy to remove, dry off and put back on and you're ready to go again.When the covers are not on the watch, they edges are a little frail and fragile, but when they're on the watch it's not a problem.Great variety for a good price.", "They are very nice and looks lovely.", "Like them", "I love these screen protectors. I love all the colors. I have no issues at all with the touch screen while these are on the watch. Although, the two with animal print seem to be thicker and those two I have to hit the screen hard to make it work. I don’t know why maybe the plastic is thicker on those two.I just don’t use those. I love these and won’t use my watch with out these screen protectors. My watch screen would be so scratched by now if I didn’t use these. They’re great!I’m definitely very happy with these. So easy to put on and take off also.", "Nice quality and fun colors", "I use these on a daily basis on my Apple Watch. I’ve cracked one of them so far and it protected my actual Apple Watch screen flawlessly. They are easy to interchange. They are easy to clean and they also keep your Apple Watch face from getting dirt and water on it.", "I bought these 3 years ago. I still have 8 left. I’m an active mom/mechanic/cyclist. These have lasted and been more durable than the other set I bought that lasted 3 months.", "I Love this order", "loved the color", "Love these items. Goes well with my new watch bands.", "Great but great deal", "I am very happy with my Apple Watch cases. I love the colors. Fits perfect.", "Nice produce elevated apple watch game", "Gets cloudy underneath when you go out in the heat or if it's in the bathroom during a shower.", "", "", "So far so good, the  cute colors!!", "These are adorable. I love changing the faces to suit my style.", "The first time I ordered these they came in and only one of the whole package actually fit correctly. I had them resend me the same exact thing and the second time they all fit correctly. The design on the cheetah print one has faded after a short time but I sorta expected that.", "Good", "Quality Apple Watch covers. Protects my watch and great touch sensitivity.  So far so good.", "I really like these. I love that I can change the color based on my mood and what I am wearing. Some times trying to unlock my watch is hard. Overall I'm glad I got them.", "Love the colors options", "Love the variety of colors to match any outfit ❣️ A little flimsy, but adequate and versatile for the money.", "Works great", "They crack easily. I still love them.", "Your watch cover easily and quickly", "I love the watch colors they are so pretty! With my old watch cover I was having issues with the screen not working but this one I’m not having any trouble with!", "So cute and easy to use. Super sturdy but they do scratch easier than the actual screen.", "these have a matt finish to them and are very fun. they fit perfect. good value for the money.", "I always have protection on my Apple Watch because I’m clumsy. For the 12 colors it came with it was about the same price two black ones I have been buying. Granite, I’m only gonna probably use four or so but it’s still cheaper than buying two black ones of similar quality. I will definitely probably buy this again if it stays this cheap.", "So amazing love having different face", "These are cute and worth the money. Very durable and easy to put on.", "Love these", "Such a wide range of colors and I Love that the screen protector is built in. You can see the dots from the screen protector at times but you barely notice after awhile. Great product", "just received them yesterdays, I do not know if the items durable yet. I love the looks of them. The price for 12 pk is great.", "", "This product depends on the purpose and what you’re looking for in them. If you’re simply looking for a fashionable designed the cover your Apple Watch, and to be able to change them out frequently then they are sufficient for what you’re looking for. They will protect your Apple Watch, however, if you are doing any type of construction, yardwork or anything that is high level of movement where you’re bumping them frequently, you do chance them popping off. I would not write them as a high-level protection. If your band is neutral as in black white, then they will match any color you put with the cover. If you have any designs on your band, then you will only be able to use a few of these to have them matching. The actual colors that come within the package are a bit off-the-wall. For the cost, I would say that you’re going to get a decent value because you’re not paying very much for these, so I guess the value does match the cost. Maybe that’s the reason why full protection is much more expensive and you don’t get the fashion. The seller was easy to work with and shipment was fast. As far as their ability. Yes, these in itself are durable, but again they do pop off easily.", "Not only do they protect my watch but I like to match my watch and clothes. These are easy to change out and quite durable.", "", "This product was simply amazing, and just what I wanted. Shipping was on time. I am just so in love with these screen protectors for my watch as I can change them to match my outfit or mood. Who knew that even with inflation you can still get good products at a great cost. The only thing that I've noticed is that if I were to leave my watch on the counter when showering the steam manages to get behind the screen protector and looks horrible and can screw up the touch screen, but for the price I usually just let it sit out for a day or two usually when I forget to charge it, thanks ADHD, and it'll sometimes dry out itself, if not I toss it and use one of the other ones. Thank you so much for this awesome product. Keep up the great work.", "Great selection for a good price. Fit well and protects watch.", "These are sturdy and they do protect but sometimes the screen is not as sensitive and you have to push harder. They look good on the watch too.", "They are all nice, and they fit perfectly and stay very well. Although I wish I didn’t have to buy so many at once because I know I won’t use but one or two of them.", "These fit perfectly, provide superb protection for the screen and, paired with a complementary watch watch band, effect a look of a new watch. Great bargain price too.", "I finally found something to protect my watch AND tons of variety. I’ve had no trouble using the screen. Just clean in between changes and everything will work out.", "", "Love the different colors to put with my clothes for the day", "My daughter hit her watch on the corner of a table and these saved her actual screen.", "My daughter loves them", "I read where it said easy to install, thats a lie. I have the apple 9. Some of the cases are very hard to get on and off. They are not the same size, I am using the ones that are easy to install.", "Love the colors, easy to switch out and protects my watch face.", "These Apple watch covers get the job done. They cover the face of the watch to prevent scratching/cracks/other damage. Easy to install. The only drawback that I have noticed is the touchscreen sensitivity of the watch is somewhat weakened. I have to add slightly more pressure to the face than I would have to without the cover. Small inconvenience for the protection of my watch. Long story short, these covers are worth the price.", "Did exactly what I wanted and gave my wife the touch of style she wanted.  Great price.", "Nice lime it no issues with touch screen easy to put on and change", "I've had a ton of watch covers however this one is the best.  It's sturdy and doesn't just fall off.  The touch screen performs really well.  If you go in the water the tempered glass may seperate a bit from the watch but with a quick wipe of the cloth they give you - just wipe it clean and it's good to go.I am a lifeguard and take this in the pool everyday.  It's been a month on my first cover in the pack.  I have no need to replace the first cover I used.  My three kids are also using these covers and they love them!  They switch them out for fashion purposes.", "Like the different colors and designs. Great quality", "These are great if you are rough on your watch like I am. Lots of different choices and great price for what you get. Some of the covers do make your watch a little less sensitive to touch but it’s not that big of an issue.", "Great price and colors to choose from. Was the wrong size but they were very nice. Would purchase again in the correct size.", "These are very nice and east to install! Love the variety", "I put one on my watch and within 2 days it popped off and I lost it somewhere. Hoping it’s just a fluke..  I couldn’t get it to sit completely flat anyways and it was very hard to touch the screen .", "I'm torn with these. Great price and variety for 8 year old boy/girl twins. Her protector lasts, his was replaced weekly. So for an adult or not super active/rambunctious child I would rate these closer to a 5.", "Came in so many colors I have had y watch for over 3 years not a single scratch", "Products is durable and so cute. Who doesn’t want to switch up the look of your watch and why not do it with these awesome covers and it helps protect your watch too!", "I am an athlete, and I am really rough on stuff. I had one of these protective cases on my watch for about 2-3 weeks before I cracked it. I also kept it on for another 2 weeks before changing it. During this time when the case was cracked I hit my watch on several things including the end of a barbell while lifting. Even though the case cracked, my watch itself had no damage to it. I rated durability a 4 for cracking, but overall this is a great product considering it still kept my watch safe after the case was cracked. The touch screen can be a little iffy at first. It's definitely not the same as no case, but the sensitivity is better than protective cases I've used before.", "", "Fits but hard to use side scroll button when the case is on.", "Just as promised.  Love changing these out on my iPhone .", "Not the worst not the best I bought this because I wanted a variety for my Apple Watch and yes, obviously as you can see you definitely get that but I feel like they’re kind of flimsy but they get the job done", "Fits my watch perfectly easy to use love all the options to change out with", "I really like this item. Very easy to put on", "These are great. Very durable. I love that I can mix and match with all my watch bands! If you have dogs that like chewing things, don’t leave these out. My dogs found them. But luckily only chewed up one. Definitely recommend buying these!FYI you will have to tap your screen slightly harder while using these. It’s not a big difference though", "I wanted more colors to match my watch to my outfit and I found this! I absolutely love it. I can be stylish and protect my watch at the same time.", "These have lasted a long time. If you are careful when removing they will last. I did find out the hard way with the first one and the screen protector cracked. I have been able to switch these out often and they hold up very well and protect my watch.", "It's a little annoying that I have to touch harder but that should be suspected. Probably worth it for the protective value. Fits snug.", "This fits perfect and looks awesome!", "I am a huge klutz and so cases and screen protectors for my devices are a must. I bought a different case for my apple watch about a year ago and I struggled with the lack of sensitivity and the fact that I would have to hit an app a million times before being able to do anything. These ARE NOT like that. I have only used a couple so far but it slips right onto the front, so no coverage for the back, but the front and sides are completely covered. The sensitivity is amazing. I barely have to touch the app options now and they open immediately. I will never go back; these are definitely worth the purchase price.", "So cute and sturdy! Protects my screen well as I tend to bang my wrist into a lot of walls when I’m walking.", "I enjoy changing my watch covers daily. I can do so with these protectors. I am also constantly washing my hands and can do so without worrying about getting my I watch face wet.", "I cannot comment on the ease or difficulty of putting these on. My husband is in charge of those kinds of things. I currently have a hot pink band and I’m using the speckled cow protector. I get lots of compliments!", "The only issue with these Apple Watch covers are the durability. They like to snap off my Apple Watch if my hand hits something and sometimes I do not even notice it has fallen off so I loose them! There have been some small pieces that have fallen off but other than that I have no complaints. I really do like these and they are very cute and protective! I wouldn’t get these if you need extra protection, but it does the job.", "", "Quick shipping ! Highly recommend", "I bought this set specifically for the leopard case, and it does not disappoint. I clicked a few on and off before leaving the leopard one on and they were super easy snap on and off with no issues. I’m on day three and so far durability has been good so we will see as time goes on, but I’m happy with my purchase. The price for the amount of covers and quality of them is worth it. Definitely recommend", "They are beautiful and easy to install!", "First of all, these are so cute! Secondly, right after I put it on, I hit it on a door frame—not a scratch or scuff on it. Third, they’re super easy to pop on and off (careful or they will pop off a little too easily). Fourth, I had a different brand before these and I had to tap my touch screen 3-4 times to do anything. I thought it was just normal since those were my first and only cases I bought…but these!!! You only have to tap once, as you should. Will buy again when I inevitably lose the majority.", "", "While I can’t speak to the longevity of the color on the cases just yet, they came exactly as pictured and even had an alcohol wipe, dust stickers and a little microfiber cloth to wipe everything down with.", "Great for protecting Apple Watch face sometimes hard to touch screen when not clean", "They stay on! One can still work the touch function of yhe watch!!", "", "I like these but the lighter colored cases get discolored quick somehow. I’ve only been wearing the pink one for about a week and it has obvious discoloration.. I haven’t gotten it wet or anything. Not very happy with it..", "I love all the options this has. Nice quality as well", "I was a little skeptical to get those due to some of the reviews with issues with touch screen, however it works perfect on my 40mm Apple Watch ! so far no complaints !!", "Great value for the money. Easy to use. Easy to clean. Comes with lots of great colors. Fits my apple watch perfectly.", "I like the different options and styles", "Good", "Great fit. Easy on/off. Good color selection. No issues with touch screen"]