[
    {
        "author": "Ronald Thomas",
        "rating": "5.0 ",
        "title": "Excellent Headphones",
        "content": "\nThey are everything they say they are. Very comfortable,  noise canceling works great and the sound is great. Battery life is also great. And you can’t beat the price!!!\n",
        "date": "Reviewed in the United States on September 5, 2024",
        "verified": "Verified Purchase",
        "image_url": null
    },
    {
        "author": "horsedoctm",
        "rating": "5.0 ",
        "title": "Work as advertised",
        "content": "\nI got these to use mainly when on the mower and they work well. They are lightweight and comfortable.  I think more expensive ones would be a little better at the noise canceling but they are certainly adequate.  The sound quality is good as well. They connected easily to my phone as well.  I haven’t had a problem with the battery life but have only had for a week; so far so good.  They also seem like they will also be durable.\n",
        "date": "Reviewed in the United States on September 6, 2024",
        "verified": "Verified Purchase",
        "image_url": null
    },
    {
        "author": "Will P.",
        "rating": "4.0 ",
        "title": "Pretty decent for a good price",
        "content": "\nWhen I placed these on my head and got them paired up with my phone. I played some music and was decently surprised. Comfort was good and sound was great. Not heavy on the bass for music but good for listening to the lyrics.Wearing them at work for 3 hours they got a little warm around my ears and had them sit on my shoulders. It was nicely designed so that the ear covers could be turned to face upwards so they were like little speakers sitting on my shoulders.I'd give time two thumbs up for this price range. I'd buy them again too for a friend.\n",
        "date": "Reviewed in the United States on July 12, 2024",
        "verified": "Verified Purchase",
        "image_url": null
    },
    {
        "author": "Tammy",
        "rating": "5.0 ",
        "title": "Comfy and great sound!",
        "content": "\nThese are my first over the ear Bluetooth headphones and I’m VERY pleased so far. I stay up late to watch tv and these are great to use so I don’t disturb other family members. I have worn these for hours and they are just SO comfortable. They seem to work well to block outside noise although you cannot turn this feature off, and may miss announcements if using in public places.They serve the purpose I wanted them for and were very reasonably priced as well.\n",
        "date": "Reviewed in the United States on August 25, 2024",
        "verified": "Verified Purchase",
        "image_url": null
    },
    {
        "author": "Douglas Novales",
        "rating": "5.0 ",
        "title": "More then I expected",
        "content": "\nThe weight of this is light enough, it’s not too heavy, my experience in the Bluetooth connectivity is easy I have no clue what’s this bad connection or something on a laptop cause for me personally it’s good, the value for this is amazing, although the active noise cancellation hardly makes a difference, the transparency mode could use a little work but I don’t mind it much, the adjustability is great making it easy to use and it’s not uncomfortable\n",
        "date": "Reviewed in the United States on August 25, 2024",
        "verified": "Verified Purchase",
        "image_url": null
    },
    {
        "author": "rabar",
        "rating": "3.0 ",
        "title": "You get what you pay for!",
        "content": "\nI really like the price of these headphones.  I wanted something with bluetooth that weren't ear buds.  These headphones work alright.  The problem is with connecting to Zoom meetings; I often get a message that they aren't working properly.  This is easy enough (though annoying) to fix, as I just go into the Zoom audio, switch it to the computer's speaker and mic, and then switch both back to the headphones, and then everything works fine.  But I have to do this almost every time I'm on Zoom, and I use it at least twice a day.  As for the noise-cancelling, I don't really use it, but I tried it--it's just a sound of static (white noise), but I don't have experience with other noise-cancelling headphones, so I don't know if they are all like that or not.  Either way, I wasn't impressed, but that's not why I bought them.  The bluetooth starts breaking up if the computer is in the living room and I go into the bedroom (about 25 ft away).  It always breaks up if the microwave is on and I'm in the kitchen, but I guess that's kind of expected with any electronics (reminds me of vacuuming with the TV on back in the day).  The sound is rather good, but I don't listen to music or play video games, so I can't really say whether it would be good for that.  The mic works well, as long as everything is working properly.  The battery lasts for a good while, although when I plug them in to charge, the headphones disconnect from the device and I can't use them while they're charging.  They serve my purpose, but I wouldn't recommend them.  If you can afford to get name-brand, then go for it.\n",
        "date": "Reviewed in the United States on May 8, 2024",
        "verified": "Verified Purchase",
        "image_url": null
    },
    {
        "author": "RJR",
        "rating": "5.0 ",
        "title": "Great Headphones!",
        "content": "\nWow! I ordered these over-the-ear headphones because my Samsung eat buds were never comfortable for me and they would often fall out of my ear, which is really a problem when that happens on a plane and the darn things rolls to who knows where under someone else's seat! Well, I just decided to forget about stupid ear buds and just get a set of over-the-ear noise canceling headphones. I was not about to shell out big bucks for them because I didn't think I would use them so much, mostly just when I'm traveling. So I looked over many options in the under $50 range and I chose these. I received them same day from Amazon. That was awesome! I opened the box, charged them fully in 2 hours. The usb to usb-c cord is included but you have to supply your own electrical power plug to plug it into a wall outlet to get the fastest charging. It also came with a 3.5mm audio cable as well. Pairing with my phone's Bluetooth was super easy, just follow the little instruction booklet. I started playing some music and I was so happy with the sound. These particular headphones have other great features like sound mode selection and the ability to turn off the noise canceling feature if you need to be able to hear the ambient sound around you while using them. Great Value for someone who's looking for comfort and good performance at a great price!\n",
        "date": "Reviewed in the United States on May 31, 2024",
        "verified": "Verified Purchase",
        "image_url": null
    },
    {
        "author": "Vicki ",
        "rating": "5.0 ",
        "title": "Very worth the price",
        "content": "\n1. Very smooth and soft material. Comfortable and nice fitting on the ears. Not too loose or tight.2. Amazing sound quality. Don’t have to raise the volume halfway in order to hear properly. Raise the volume just one time and the audio is perfect, zero strain on the ears. Though they are noise canceling, they give you just enough volume to not only muffle/decrease any surrounding and distracting noise, but to also give you the ability to hear outside noise just enough that you won’t miss your name being called, etc.3. You can be on your side while wearing them. As someone who preferably likes to lay and sleep on their side, having over the ear headphones usually isn’t comfortable. However, because these headphones aren’t so thick, you can practically be in any position you want.4. If your headphones aren’t connecting, all you need to do is shut off your phone and turn it back on again.\n",
        "date": "Reviewed in the United States on August 11, 2024",
        "verified": "Verified Purchase",
        "image_url": "https://m.media-amazon.com/images/I/61JqzCLE+lL._SY88.jpg"
    },
    {
        "author": "JNav3355",
        "rating": "5.0 ",
        "title": "Excellent for the price, functions as a daily wear and use.",
        "content": "\nThese have a long battery life, and the noise cancellation is helpful in noisy environments. There is a small button on the right side that you press to turn it Off, as when you first turn on the headphones it is on by default, and a Separate Green LED turns on to signal this (though you wouldn't be able to tell unless you were looking at yourself wearing them in the mirror, so I'm not sure why). That same button doesn't immediately turn off ANC (Audio Noise Cancellation) mode, first it goes in Transparency mode which actually BOOSTS the audio from outside whats playing from Bluetooth to help you hear whats going on around you in the room, which might be helpful when traveling and you need to hear Airport announcements for example. Then, the next mode is Off, which saves battery life supposedly, though I can hardly tell as they have easily lasted 24+ on a single charge, though being that I use these all day, I am familiar with battery life eventually shortening, so I may update if that happens.I'm glad I spent the extra for the ANC mode\n",
        "date": "Reviewed in the United States on September 1, 2024",
        "verified": "Verified Purchase",
        "image_url": null
    },
    {
        "author": "The Bothwells",
        "rating": "4.0 ",
        "title": "Amazing",
        "content": "\nAs a diehard Bose fan for years, I decided to try this in comparison because Bose is incredibly pricey. I was SHOCKED at how comparable the quality of these was to my Bose QuietComfort 35 II. I dare say they are actually more comfortable! I can easily sleep in them (I’m a side sleeper) and the noise cancelling feels just as good if not better than Bose. The ONLY downside I’ve had is if you don’t have something playing, there is a tiny periodic beep you will hear in the left ear like it’s searching for a signal. But honestly for 10% of the price of Bose, you get at least 95% of the quality. I am not a certified audiophile, but as someone with sound sensitivities who lives in a bottom floor apartment with dogs barking and footsteps constantly overhead, I practically live in my noise-cancelling headphones, and the sound quality is just as good if not better to my ears’ judgement! I’m shocked and will definitely buy again instead of Bose!\n",
        "date": "Reviewed in the United States on August 16, 2024",
        "verified": "Verified Purchase",
        "image_url": null
    }
]